nxp-mcuxpresso/mcux-soc-svd/MCXW716A/MCXW716A.xml
        <register>
          <name>PRS5</name>
          <description>Priority Slave Registers</description>
          <addressOffset>0x500</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x543210</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>M0</name>
              <description>Master 0 Priority</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M0_0</name>
                  <description>This master has level 1 or highest priority when accessing the slave port.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M0_1</name>
                  <description>This master has level 2 priority when accessing the slave port.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M0_2</name>
                  <description>This master has level 3 priority when accessing the slave port.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M0_3</name>
                  <description>This master has level 4 priority when accessing the slave port.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M0_4</name>
                  <description>This master has level 5 priority when accessing the slave port.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M0_5</name>
                  <description>This master has level 6 priority when accessing the slave port.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M0_6</name>
                  <description>This master has level 7 priority when accessing the slave port.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M0_7</name>
                  <description>This master has level 8 or the lowest priority when accessing the slave port.</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M1</name>
              <description>Master 1 Priority</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M1_0</name>
                  <description>This master has level 1 or highest priority when accessing the slave port.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M1_1</name>
                  <description>This master has level 2 priority when accessing the slave port.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M1_2</name>
                  <description>This master has level 3 priority when accessing the slave port.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M1_3</name>
                  <description>This master has level 4 priority when accessing the slave port.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M1_4</name>
                  <description>This master has level 5 priority when accessing the slave port.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M1_5</name>
                  <description>This master has level 6 priority when accessing the slave port.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M1_6</name>
                  <description>This master has level 7 priority when accessing the slave port.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M1_7</name>
                  <description>This master has level 8 or lowest priority when accessing the slave port.</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M2</name>
              <description>Master 2 Priority</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M2_0</name>
                  <description>This master has level 1 or highest priority when accessing the slave port.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M2_1</name>
                  <description>This master has level 2 priority when accessing the slave port.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M2_2</name>
                  <description>This master has level 3 priority when accessing the slave port.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M2_3</name>
                  <description>This master has level 4 priority when accessing the slave port.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M2_4</name>
                  <description>This master has level 5 priority when accessing the slave port.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M2_5</name>
                  <description>This master has level 6 priority when accessing the slave port.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M2_6</name>
                  <description>This master has level 7 priority when accessing the slave port.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M2_7</name>
                  <description>This master has level 8the or lowest priority when accessing the slave port.</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M3</name>
              <description>Master 3 Priority</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M3_0</name>
                  <description>This master has level 1 or highest priority when accessing the slave port.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M3_1</name>
                  <description>This master has level 2 priority when accessing the slave port.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M3_2</name>
                  <description>This master has level 3 priority when accessing the slave port.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M3_3</name>
                  <description>This master has level 4 priority when accessing the slave port.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M3_4</name>
                  <description>This master has level 5 priority when accessing the slave port.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M3_5</name>
                  <description>This master has level 6 priority when accessing the slave port.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M3_6</name>
                  <description>This master has level 7 priority when accessing the slave port.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M3_7</name>
                  <description>This master has level 8the or lowest priority when accessing the slave port.</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M4</name>
              <description>Master 4 Priority</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M4_0</name>
                  <description>This master has level 1 or highest priority when accessing the slave port.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M4_1</name>
                  <description>This master has level 2 priority when accessing the slave port.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M4_2</name>
                  <description>This master has level 3 priority when accessing the slave port.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M4_3</name>
                  <description>This master has level 4 priority when accessing the slave port.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M4_4</name>
                  <description>This master has level 5 priority when accessing the slave port.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M4_5</name>
                  <description>This master has level 6 priority when accessing the slave port.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M4_6</name>
                  <description>This master has level 7 priority when accessing the slave port.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M4_7</name>
                  <description>This master has level 8 or lowest priority when accessing the slave port.</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M5</name>
              <description>Master 5 Priority</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M5_0</name>
                  <description>This master has level 1 or highest priority when accessing the slave port.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M5_1</name>
                  <description>This master has level 2 priority when accessing the slave port.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M5_2</name>
                  <description>This master has level 3 priority when accessing the slave port.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M5_3</name>
                  <description>This master has level 4 priority when accessing the slave port.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M5_4</name>
                  <description>This master has level 5 priority when accessing the slave port.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M5_5</name>
                  <description>This master has level 6 priority when accessing the slave port.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M5_6</name>
                  <description>This master has level 7 priority when accessing the slave port.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M5_7</name>
                  <description>This master has level 8 or lowest priority when accessing the slave port.</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CRS5</name>
          <description>Control Register</description>
          <addressOffset>0x510</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PARK</name>
              <description>Park</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PARK_1</name>
                  <description>Park on master port M1.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PARK_2</name>
                  <description>Park on master port M2.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PARK_3</name>
                  <description>Park on master port M3.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PARK_4</name>
                  <description>Park on master port M4.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PARK_5</name>
                  <description>Park on master port M5.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PARK_6</name>
                  <description>Park on master port M6.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PARK_7</name>
                  <description>Park on master port M0.</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PCTL</name>
              <description>Parking Control</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PCTL_0</name>
                  <description>When no master makes a request, the arbiter parks the slave port on the master port defined by the PARK field.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PCTL_1</name>
                  <description>When no master makes a request, the arbiter parks the slave port on the last master to be in control of the slave port.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PCTL_2</name>
                  <description>When no master makes a request, the slave port is not parked on a master and the arbiter drives all outputs to a constant safe state.</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ARB</name>
              <description>Arbitration Mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ARB_0</name>
                  <description>Fixed priority</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARB_1</name>
                  <description>Round-robin(RR) or rotating priority</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HLP</name>
              <description>Halt Low Priority</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HLP_0</name>
                  <description>The low-power mode request has the highest priority for arbitration on this slave port.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HLP_1</name>
                  <description>The low-power mode request has the lowest initial priority for arbitration on this slave port.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RO</name>
              <description>Read Only</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RO_0</name>
                  <description>The slave port's registers are writeable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RO_1</name>
                  <description>The slave port's registers are read-only and cannot be written. Attempted writes do not affect the registers and result in a bus error response.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
