nxp-mcuxpresso/mcux-soc-svd/MCXW716A/MCXW716A.xml
        <register>
          <name>SEQ_CTRL_STS</name>
          <description>SEQUENCE CONTROL AND STATUS</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x8</resetValue>
          <resetMask>0xE0C000FF</resetMask>
          <fields>
            <field>
              <name>FORCE_CLK_ON</name>
              <description>Force On 802.15.4 phy_gck</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FORCE_CLK_ON_0</name>
                  <description>Allow TSM to control 802.15.4 phy_gck, for minimum power consumption (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FORCE_CLK_ON_1</name>
                  <description>Force on 802.15.4 phy_gclk at all times, for debug purposes only</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLR_NEW_SEQ_INHIBIT</name>
              <description>Overrides the automatic hardware locking of the programmed XCVSEQ while an autosequence is underway</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVENT_TMR_DO_NOT_LATCH</name>
              <description>Overrides the automatic hardware latching of the Event Timer</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LATCH_PREAMBLE</name>
              <description>Stickiness Control for Preamble Detection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LATCH_PREAMBLE_0</name>
                  <description>Don't make PREAMBLE_DET and SFD_DET bits of PHY_STS (SEQ_STATE) Register &quot;sticky&quot;, i.e, these status bits reflect the realtime, dynamic state of preamble_detect and sfd_detect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LATCH_PREAMBLE_1</name>
                  <description>Make PREAMBLE_DET and SFD_DET bits of PHY_STS (SEQ_STATE) Register &quot;sticky&quot;, i.e., occurrences of preamble and SFD detection are latched and held until the start of the next autosequence</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NO_RX_RECYCLE</name>
              <description>Disable Automatic RX Sequence Recycling</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_CRC_ERROR</name>
              <description>Induce a CRC Error in Transmitted Packets</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FORCE_CRC_ERROR_0</name>
                  <description>normal operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FORCE_CRC_ERROR_1</name>
                  <description>Force the next transmitted packet to have a CRC error</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CONTINUOUS_EN</name>
              <description>Enable Continuous TX or RX Mode</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CONTINUOUS_EN_0</name>
                  <description>normal operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONTINUOUS_EN_1</name>
                  <description>Continuous TX or RX mode is enabled (depending on XCVSEQ setting).</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XCVSEQ_ACTUAL</name>
              <description>Indicates the programmed sequence that has been recognized by the ZSM Sequence Manager</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SEQ_IDLE</name>
              <description>ZSM Sequence Idle Indicator</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NEW_SEQ_INHIBIT</name>
              <description>New Sequence Inhibit</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_TIMEOUT_PENDING</name>
              <description>Indicates a TMR3 RX Timeout is Pending</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_MODE</name>
              <description>RX Operation in Progress</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TMR2_SEQ_TRIG_ARMED</name>
              <description>indicates that TMR2 has been programmed and is armed to trigger a new autosequence</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SEQ_T_STATUS</name>
              <description>Status of the just-completed or ongoing Sequence T or Sequence TR</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SW_ABORTED</name>
              <description>Autosequence has terminated due to a Software abort.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TC3_ABORTED</name>
              <description>autosequence has terminated due to an TMR3 timeout</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PLL_ABORTED</name>
              <description>Autosequence has terminated due to an PLL unlock event</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EXT_ABORTED</name>
              <description>Autosequence has terminated due to a Wake-On-Radio command</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ARB_GRANT_DEASSERTION_ABORTED</name>
              <description>Autosequence has terminated due to an arb_grant deassertion event</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ACKDELAY</name>
          <description>ACK DELAY</description>
          <addressOffset>0x7C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x2D0002</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ACKDELAY</name>
              <description>ACK Delay</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXDELAY</name>
              <description>TX Delay</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXDELAY</name>
              <description>RX Delay</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FAST_TX_WD_EN</name>
              <description>Fast TX_WD enable/disable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FAST_TX_WD_EN_0</name>
                  <description>Disable fast Tx warmdown sequence.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FAST_TX_WD_EN_1</name>
                  <description>Enable fast Tx warmdown sequence.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FAST_TX_WD_DELAY</name>
              <description>FAST_TX_WD_DELAY</description>
              <bitOffset>25</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FILTERFAIL_CODE</name>
          <description>FILTER FAIL CODE</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFC00</resetMask>
          <fields>
            <field>
              <name>FILTERFAIL_CODE</name>
              <description>Filter Fail Code</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FILTERFAIL_PAN_SEL</name>
              <description>PAN Selector for Filter Fail Code</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FILTERFAIL_PAN_SEL_0</name>
                  <description>FILTERFAIL_CODE[9:0] will report the FILTERFAIL status of PAN0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FILTERFAIL_PAN_SEL_1</name>
                  <description>FILTERFAIL_CODE[9:0] will report the FILTERFAIL status of PAN1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_WTR_MARK</name>
          <description>RECEIVE WATER MARK</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RX_WTR_MARK</name>
              <description>RECEIVE WATER MARK</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SLOT_PRELOAD</name>
          <description>SLOT PRELOAD</description>
          <addressOffset>0x8C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x74</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SLOT_PRELOAD</name>
              <description>Slotted Mode Preload</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEQ_STATE</name>
          <description>802.15.4 SEQUENCE STATE</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xC000C0E0</resetMask>
          <fields>
            <field>
              <name>SEQ_STATE</name>
              <description>ZSM Sequence State</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PREAMBLE_DET</name>
              <description>Preamble Detected</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SFD_DET</name>
              <description>SFD Detected</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FILTERFAIL_FLAG_SEL</name>
              <description>Consolidated Filter Fail Flag</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CRCVALID</name>
              <description>CRC Valid Indicator</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CRCVALID_0</name>
                  <description>Rx FCS != calculated CRC (incorrect)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRCVALID_1</name>
                  <description>Rx FCS = calculated CRC (correct)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLL_ABORT</name>
              <description>Raw PLL Abort Signal</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PLL_ABORTED</name>
              <description>Autosequence has terminated due to an PLL unlock event</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_BYTE_COUNT</name>
              <description>Realtime Received Byte Count</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CCCA_BUSY_CNT</name>
              <description>Number of CCA Measurements resulting in Busy Channel</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TMR_PRESCALE</name>
          <description>TIMER PRESCALER</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TMR_PRESCALE</name>
              <description>Timer Prescaler</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TMR_PRESCALE_2</name>
                  <description>500kHz (33.55 S)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR_PRESCALE_3</name>
                  <description>250kHz (67.11 S)</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR_PRESCALE_4</name>
                  <description>125kHz (134.22 S)</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR_PRESCALE_5</name>
                  <description>62.5kHz (268.44 S) -- default</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR_PRESCALE_6</name>
                  <description>31.25kHz (536.87 S)</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR_PRESCALE_7</name>
                  <description>15.625kHz (1073.74 S)</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LENIENCY_LSB</name>
          <description>LENIENCY LSB</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LENIENCY_LSB</name>
              <description>Leniency LSB Register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LENIENCY_MSB</name>
          <description>LENIENCY MSB</description>
          <addressOffset>0x9C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LENIENCY_MSB</name>
              <description>Leniency MSB Register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PART_ID</name>
          <description>PART ID</description>
          <addressOffset>0xA0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x4</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PART_ID</name>
              <description>802.15.4 Part ID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
