nxp-mcuxpresso/mcux-soc-svd/MCXW716A/MCXW716A.xml
        <register>
          <name>DTEST_PIN_CTRL2</name>
          <description>DTEST PIN Control 2 register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xB0A0908</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DTEST_PIN8_MUX_SEL</name>
              <description>DTEST_PIN8_MUX_SEL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DTEST_PIN8_OVRD_SEL</name>
              <description>DTEST_PIN8_OVRD_SEL</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DTEST_PIN8_OVRD_SEL_0</name>
                  <description>override is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTEST_PIN8_OVRD_SEL_1</name>
                  <description>aa_sfd_matched</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTEST_PIN8_OVRD_SEL_2</name>
                  <description>rx_pd_fnd</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTEST_PIN8_OVRD_SEL_3</name>
                  <description>agc_gain_change</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTEST_PIN8_OVRD_SEL_4</name>
                  <description>tsm_combined_tx_en</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTEST_PIN8_OVRD_SEL_5</name>
                  <description>tsm_combined_rx_en</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTEST_PIN8_OVRD_SEL_6</name>
                  <description>crc_fail</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTEST_PIN8_OVRD_SEL_7</name>
                  <description>decode_data_out</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTEST_PIN8_OVRD_SEL_8</name>
                  <description>tx_data_out</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTEST_PIN8_OVRD_SEL_9</name>
                  <description>nbu_testbus[14]</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTEST_PIN8_OVRD_SEL_10</name>
                  <description>nbu_testbus[15]</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DTEST_PIN9_MUX_SEL</name>
              <description>DTEST_PIN9_MUX_SEL</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DTEST_PIN9_OVRD_SEL</name>
              <description>DTEST_PIN9_OVRD_SEL</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DTEST_PIN9_OVRD_SEL_0</name>
                  <description>override is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTEST_PIN9_OVRD_SEL_1</name>
                  <description>aa_sfd_matched</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTEST_PIN9_OVRD_SEL_2</name>
                  <description>rx_pd_fnd</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTEST_PIN9_OVRD_SEL_3</name>
                  <description>agc_gain_change</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTEST_PIN9_OVRD_SEL_4</name>
                  <description>tsm_combined_tx_en</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTEST_PIN9_OVRD_SEL_5</name>
                  <description>tsm_combined_rx_en</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTEST_PIN9_OVRD_SEL_6</name>
                  <description>crc_fail</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTEST_PIN9_OVRD_SEL_7</name>
                  <description>decode_data_out</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTEST_PIN9_OVRD_SEL_8</name>
                  <description>tx_data_out</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTEST_PIN9_OVRD_SEL_9</name>
                  <description>nbu_testbus[14]</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTEST_PIN9_OVRD_SEL_10</name>
                  <description>nbu_testbus[15]</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DTEST_PIN10_MUX_SEL</name>
              <description>DTEST_PIN10_MUX_SEL</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DTEST_PIN10_OVRD_SEL</name>
              <description>DTEST_PIN10_OVRD_SEL</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DTEST_PIN10_OVRD_SEL_0</name>
                  <description>override is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTEST_PIN10_OVRD_SEL_1</name>
                  <description>aa_sfd_matched</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTEST_PIN10_OVRD_SEL_2</name>
                  <description>rx_pd_fnd</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTEST_PIN10_OVRD_SEL_3</name>
                  <description>agc_gain_change</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTEST_PIN10_OVRD_SEL_4</name>
                  <description>tsm_combined_tx_en</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTEST_PIN10_OVRD_SEL_5</name>
                  <description>tsm_combined_rx_en</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTEST_PIN10_OVRD_SEL_6</name>
                  <description>crc_fail</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTEST_PIN10_OVRD_SEL_7</name>
                  <description>decode_data_out</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTEST_PIN10_OVRD_SEL_8</name>
                  <description>tx_data_out</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTEST_PIN10_OVRD_SEL_9</name>
                  <description>nbu_testbus[14]</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTEST_PIN10_OVRD_SEL_10</name>
                  <description>nbu_testbus[15]</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DTEST_PIN11_MUX_SEL</name>
              <description>DTEST_PIN11_MUX_SEL</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DTEST_PIN11_OVRD_SEL</name>
              <description>DTEST_PIN11_OVRD_SEL</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DTEST_PIN11_OVRD_SEL_0</name>
                  <description>override is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTEST_PIN11_OVRD_SEL_1</name>
                  <description>aa_sfd_matched</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTEST_PIN11_OVRD_SEL_2</name>
                  <description>rx_pd_fnd</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTEST_PIN11_OVRD_SEL_3</name>
                  <description>agc_gain_change</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTEST_PIN11_OVRD_SEL_4</name>
                  <description>tsm_combined_tx_en</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTEST_PIN11_OVRD_SEL_5</name>
                  <description>tsm_combined_rx_en</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTEST_PIN11_OVRD_SEL_6</name>
                  <description>crc_fail</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTEST_PIN11_OVRD_SEL_7</name>
                  <description>decode_data_out</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTEST_PIN11_OVRD_SEL_8</name>
                  <description>tx_data_out</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTEST_PIN11_OVRD_SEL_9</name>
                  <description>nbu_testbus[14]</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTEST_PIN11_OVRD_SEL_10</name>
                  <description>nbu_testbus[15]</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
