nxp-mcuxpresso/mcux-soc-svd/MCXW716A/MCXW716A.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>BRIC</name>
      <description>BRIC</description>
      <groupName>BRIC</groupName>
      <baseAddress>0x48A06700</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xFF</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>KEY0_[%s]</name>
          <description>KEY0 Registers (PKB)</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>KEY0_x</name>
              <description>KEY0 written through PKB interface</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY1_0</name>
          <description>KEY1 Registers (PKB)</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>KEY1_x</name>
              <description>KEY1 written through PKB interface</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY1_1</name>
          <description>KEY1 Registers (PKB)</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>KEY1_x</name>
              <description>KEY1 written through PKB interface</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY1_2</name>
          <description>KEY1 Registers (PKB)</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>KEY1_x</name>
              <description>KEY1 written through PKB interface</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY1_3</name>
          <description>KEY1 Registers (PKB)</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>KEY1_x</name>
              <description>KEY1 written through PKB interface</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BRIC_CONFIG</name>
          <description>BRIC CONFIG register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x200</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>KEY_INDEX</name>
              <description>KEY INDEX</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IPS_XFR_ERR_EN</name>
              <description>Enable (0x1) ips_xfr_err generation on IPS access during HW mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IPS_XFR_WAIT_EN</name>
              <description>Enable (0x1) ips_xfr_wait generation on IPS access during HW mode</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HI_MODE</name>
              <description>Indicates HW mode request to BRIC is active</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HI_READY</name>
              <description>Indicates HW mode is in progress and any SW access during this time is responded with an IPS_ERROR or IPS_WAIT depending on the configuration</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIS_PKB_ERR_RESP</name>
              <description>Disable (0x1) PKB error response (Error response will be forced to zero)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>LTC</name>
      <description>LTC</description>
      <groupName>LTC</groupName>
      <baseAddress>0x48A06800</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x7F4</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>MD</name>
          <description>Mode Register</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ENC</name>
              <description>Encrypt/Decrypt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DECRYPT</name>
                  <description>Decrypt.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENCRYPT</name>
                  <description>Encrypt.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ICV_TEST</name>
              <description>ICV Checking / Test AES fault detection.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AS</name>
              <description>Algorithm State</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UPDATE</name>
                  <description>Update</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INITIALIZE</name>
                  <description>Initialize</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FINALIZE</name>
                  <description>Finalize</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INITFINAL</name>
                  <description>Initialize/Finalize</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AAI</name>
              <description>Additional Algorithm information</description>
              <bitOffset>4</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ALG</name>
              <description>Algorithm</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AES</name>
                  <description>AES</description>
                  <value>0x10</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>KS</name>
          <description>Key Size Register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x10</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>KS</name>
              <description>Key Size</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DS</name>
          <description>Data Size Register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DS</name>
              <description>Data Size</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ICVS</name>
          <description>ICV Size Register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ICVS</name>
              <description>ICV Size, in Bytes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COM</name>
          <description>Command Register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ALL</name>
              <description>Reset All Internal Logic</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_RESET</name>
                  <description>Do Not Reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESET_ALL</name>
                  <description>Reset all CHAs in use by this CCB.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AES</name>
              <description>Reset AESA</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_RESET</name>
                  <description>Do Not Reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESET_AESA</name>
                  <description>Reset AES Accelerator</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTL</name>
          <description>Control Register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IM</name>
              <description>Interrupt Mask</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INT_NOT_MASKED</name>
                  <description>Interrupt not masked.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT_MASKED</name>
                  <description>Interrupt masked</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IFE</name>
              <description>Input FIFO DMA Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IFE_DISABLED</name>
                  <description>DMA Request and Done signals disabled for the Input FIFO.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IFE_ENABLED</name>
                  <description>DMA Request and Done signals enabled for the Input FIFO.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IFR</name>
              <description>Input FIFO DMA Request Size</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IFR_1</name>
                  <description>DMA request size is 1 entry.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IFR_4</name>
                  <description>DMA request size is 4 entries.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OFE</name>
              <description>Output FIFO DMA Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFE_DISABLED</name>
                  <description>DMA Request and Done signals disabled for the Output FIFO.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFE_ENABLED</name>
                  <description>DMA Request and Done signals enabled for the Output FIFO.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OFR</name>
              <description>Output FIFO DMA Request Size</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFR_1</name>
                  <description>DMA request size is 1 entry.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFR_4</name>
                  <description>DMA request size is 4 entries.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IFS</name>
              <description>Input FIFO Byte Swap</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IFS_NO_SWAP</name>
                  <description>Do Not Byte Swap Data.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IFS_SWAP</name>
                  <description>Byte Swap Data.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OFS</name>
              <description>Output FIFO Byte Swap</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFS_NO_SWAP</name>
                  <description>Do Not Byte Swap Data.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFS_SWAP</name>
                  <description>Byte Swap Data.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>KIS</name>
              <description>Key Register Input Byte Swap</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>KIS_NO_SWAP</name>
                  <description>Do Not Byte Swap Data.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>KIS_SWAP</name>
                  <description>Byte Swap Data.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>KOS</name>
              <description>Key Register Output Byte Swap</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>KOS_NO_SWAP</name>
                  <description>Do Not Byte Swap Data.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>KOS_SWAP</name>
                  <description>Byte Swap Data.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CIS</name>
              <description>Context Register Input Byte Swap</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CIS_NO_SWAP</name>
                  <description>Do Not Byte Swap Data.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CIS_SWAP</name>
                  <description>Byte Swap Data.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COS</name>
              <description>Context Register Output Byte Swap</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COS_NO_SWAP</name>
                  <description>Do Not Byte Swap Data.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COS_SWAP</name>
                  <description>Byte Swap Data.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>KAL</name>
              <description>Key Register Access Lock</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>KAL_READABLE</name>
                  <description>Key Register is readable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>KAL_NOT_READABLE</name>
                  <description>Key Register is not readable.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
