nxp-mcuxpresso/mcux-soc-svd/MCXW716A/MCXW716A.xml
        <register>
          <name>WB_RSSI_RES1</name>
          <description>Wide-Band RSSI Result 1</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ED_WB</name>
              <description>WB RSSI ED Result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CCA1_STATE_WB</name>
              <description>WB RSSI CCA1 State</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MEAS_COMPLETE_WB</name>
              <description>WB RSSI Measure Complete</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WB_RSSI_DFT</name>
          <description>Wide-Band RSSI DFT Result</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SLOW_MAG</name>
              <description>WB RSSI Slow Magnitude Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FAST_MAG</name>
              <description>WB RSSI Fast Magnitude Value</description>
              <bitOffset>10</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NB_RSSI_CTRL0</name>
          <description>Narrow-Band RSSI Control 0</description>
          <addressOffset>0x7C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x400022</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RSSI_N_WINDOW_NB</name>
              <description>NB RSSI N Window Averager Factor</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSSI_M_WINDOW_NB</name>
              <description>NB RSSI M Window Averager Factor</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSSI_IIR_WAIT_NB</name>
              <description>NB RSSI IIR Filter Initial Wait Time</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSSI_IIR_WT_NB</name>
              <description>NB RSSI IIR Filter Factor</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SNR_ADJ_NB</name>
              <description>NB RSSI SNR Adjust Value</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>KEEP_RSSI_RESULT_NB</name>
              <description>When enabled, the NB-RSSI results will keep until next update/refresh, or the NB-RSSI results will be cleared when rx_init or rssi_init asserts</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSSI_ADJ_NB</name>
              <description>NB RSSI Adjust Value</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NB_RSSI_CTRL1</name>
          <description>Narrow-Band RSSI Control 1</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LQI_RSSI_WEIGHT</name>
              <description>RSSI Weight For LQI Calulation</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LQI_SNR_WEIGHT</name>
              <description>SNR Weight For LQI Calulation</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LQI_RSSI_SENS_ADJ</name>
              <description>LQI Sensitivity Adjust Value</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LQI_BIAS</name>
              <description>LQI Bias Value</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NB_RSSI_RES0</name>
          <description>Narrow-Band RSSI Result 0</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x80800100</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RSSI_NB</name>
              <description>NB RSSI Result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RSSI_RDY_NB</name>
              <description>This bit set when RSSI_NB/SNR_NB/LQI_NB/ED_NB value ready to read(or updated) and cleared by rx_init or write &quot;1&quot; to this field(W1C)</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSSI_RAW_NB</name>
              <description>Raw NB RSSI Result</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NOISE_RSSI_RAW_NB</name>
              <description>Raw Noise Result</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NB_RSSI_RES1</name>
          <description>Narrow-Band RSSI Result 1</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ED_NB</name>
              <description>NB RSSI ED Result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LQI_NB</name>
              <description>NB RSSI LQI Result</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SNR_NB</name>
              <description>NB RSSI SNR Result</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CCA1_STATE_NB</name>
              <description>NB RSSI CCA1 State</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MEAS_COMPLETE_NB</name>
              <description>NB RSSI Measure Complete</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NB_RSSI_DFT</name>
          <description>Narrow-Band RSSI DFT Result</description>
          <addressOffset>0x8C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AVG_NOISE_MAG_NB</name>
              <description>NB RSSI Averaged Noise Magnitude Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AVG_MAG_NB</name>
              <description>NB RSSI Averaged Magnitude Value</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC_CTRL</name>
          <description>AGC Control</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x805CCD10</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AGC_UNHOLD_FEAT_EN</name>
              <description>AGC Unhold Enalbe</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AGC_HOLD_EN</name>
              <description>AGC Hold Mode Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AGC_HOLD_EN_0</name>
                  <description>Disable AGC hold mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AGC_HOLD_EN_1</name>
                  <description>AGC hold when preamble found</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AGC_HOLD_EN_2</name>
                  <description>AGC hold when AGC hold timeout matched</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AGC_HOLD_EN_3</name>
                  <description>AGC hold when preamble found or hold timeout matched</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AGC_DELTA_SLOW_STEP</name>
              <description>AGC Delta Slow Mode Gain Step Up Value</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AGC_DELTA_SLOW_EN</name>
              <description>AGC Delta Slow Magitude Mode Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AGC_DELTA_SLOW_EN_0</name>
                  <description>Disable AGC delta slow magnitude mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AGC_DELTA_SLOW_EN_1</name>
                  <description>Enable AGC delta slow magnitude mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AGC_SLOW_EN</name>
              <description>AGC Slow Magitude Mode Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AGC_SLOW_EN_0</name>
                  <description>Disable AGC slow magnitude mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AGC_SLOW_EN_1</name>
                  <description>Enable AGC slow magnitude mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AGC_FAST_STEP_UP_EN</name>
              <description>AGC Fast Magitude Mode Step Up Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AGC_FAST_STEP_UP_EN_0</name>
                  <description>Fast magnitude mode can only make AGC gain index step down</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AGC_FAST_STEP_UP_EN_1</name>
                  <description>Fast magnitude mode can make AGC gain index step down or step up</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AGC_FAST_EN</name>
              <description>AGC Fast Magitude Mode Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AGC_FAST_EN_0</name>
                  <description>Disable fast magnitude mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AGC_FAST_EN_1</name>
                  <description>Enable fast magnitude mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AGC_WBD_STEP2_SZ</name>
              <description>AGC WBD Step2 Gain Decreas Value</description>
              <bitOffset>11</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AGC_WBD_STEP1_SZ</name>
              <description>AGC WBD Step1 Gain Decreas Value</description>
              <bitOffset>14</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AGC_WBD_THR2</name>
              <description>AGC WBD Step2 threshold</description>
              <bitOffset>17</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AGC_WBD_THR1</name>
              <description>AGC WBD Step1 threshold</description>
              <bitOffset>21</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AGC_WBD_THR1_0</name>
                  <description>49.31</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AGC_WBD_THR1_1</name>
                  <description>67.56</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AGC_WBD_THR1_2</name>
                  <description>90.98</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AGC_WBD_THR1_3</name>
                  <description>117.42</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AGC_WBD_THR1_4</name>
                  <description>150.66</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AGC_WBD_THR1_5</name>
                  <description>180.98</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AGC_WBD_THR1_6</name>
                  <description>211.87</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AGC_WBD_THR1_7</name>
                  <description>245.2</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AGC_WBD_THR1_8</name>
                  <description>288.31</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AGC_WBD_THR1_9</name>
                  <description>336.02</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AGC_WBD_THR1_10</name>
                  <description>394.34</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AGC_WBD_THR1_11</name>
                  <description>462.71</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AGC_WBD_THR1_12</name>
                  <description>548.04</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AGC_WBD_THR1_13</name>
                  <description>650.13</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AGC_WBD_THR1_14</name>
                  <description>771.65</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AGC_WBD_THR1_15</name>
                  <description>918.12</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AGC_WBD_STEP2_DUAL_CLIP_EN</name>
              <description>AGC WBD Step2 Dual Clip Enable</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AGC_WBD_STEP1_DUAL_CLIP_EN</name>
              <description>AGC WBD Step1 Dual Clip Enable</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AGC_WBD_GAIN_LIMIT_EN</name>
              <description>AGC WBD Gain Limit</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AGC_WBD_AUTO_DIS_CFG</name>
              <description>AGC WBD Auto Disable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AGC_WBD_EN</name>
              <description>AGC WBD Enable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AGC_WBD_EN_0</name>
                  <description>AGC WBD is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AGC_WBD_EN_1</name>
                  <description>AGC WBD step1 is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AGC_WBD_EN_2</name>
                  <description>AGC WBD step1 and step2 is enabled</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
