nxp-mcuxpresso/mcux-soc-svd/MCXW716A/MCXW716A.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>XCVR_ZBDEMOD</name>
      <description>XCVR_ZBDEMOD</description>
      <groupName>XCVR_ZBDEMOD</groupName>
      <baseAddress>0x48A07500</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x2C</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CORR_CTRL</name>
          <description>802.15.4 DEMOD CORRELATOR CONTROL</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x482</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CORR_VT</name>
              <description>CORR_VT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORR_NVAL</name>
              <description>CORR_NVAL</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MAX_CORR_EN</name>
              <description>MAX_CORR_EN</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ZBDEM_CLK_ON</name>
              <description>Force 802.15.4 Demodulator Clock On</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ZBDEM_CLK_ON_0</name>
                  <description>Normal Operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ZBDEM_CLK_ON_1</name>
                  <description>Force 802.15.4 Demodulator Clock On (debug purposes only)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX_MAX_CORR</name>
              <description>RX_MAX_CORR</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_MAX_PREAMBLE</name>
              <description>RX_MAX_PREAMBLE</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PN_TYPE</name>
          <description>802.15.4 DEMOD PN TYPE</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PN_TYPE</name>
              <description>PN_TYPE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_INV</name>
              <description>TX_INV</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PN_CODE</name>
          <description>802.15.4 DEMOD PN CODE</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x744AC39B</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PN_LSB</name>
              <description>PN_LSB</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PN_MSB</name>
              <description>PN_MSB</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNC_CTRL</name>
          <description>802.15.4 DEMOD SYMBOL SYNC CONTROL</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x8</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SYNC_PER</name>
              <description>Symbol Sync Tracking Period</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRACK_ENABLE</name>
              <description>TRACK_ENABLE</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRACK_ENABLE_0</name>
                  <description>symbol timing synchronization tracking disabled in Rx frontend</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRACK_ENABLE_1</name>
                  <description>symbol timing synchronization tracking enabled in Rx frontend (default)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CCA_LQI_SRC</name>
          <description>802.15.4 CCA/LQI SOURCE</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xC</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CCA1_FROM_RX_DIG</name>
              <description>Selects the Source of CCA1 (Clear Channel Assessment Mode 1) Information Provided to the 802.15.4 Link Layer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CCA1_FROM_RX_DIG_0</name>
                  <description>Use the CCA1 information computed internally in the 802.15.4 Demod</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCA1_FROM_RX_DIG_1</name>
                  <description>Use the CCA1 information computed by the RX Digital</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LQI_FROM_RX_DIG</name>
              <description>Selects the Source of LQI (Link Quality Indicator) Information Provided to the 802.15.4 Link Layer</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LQI_FROM_RX_DIG_0</name>
                  <description>Use the LQI information computed internally in the 802.15.4 Demod</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LQI_FROM_RX_DIG_1</name>
                  <description>Use the LQI information computed by the RX Digital</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LQI_START_AT_SFD</name>
              <description>Select Start Point for LQI Computation</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LQI_START_AT_SFD_0</name>
                  <description>Start LQI computation at Preamble Detection (similar to previous NXP 802.15.4 products)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LQI_START_AT_SFD_1</name>
                  <description>Start LQI computation at SFD (Start of Frame Delimiter) Detection</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ZBDEM_CCA_CLK_ON</name>
              <description>802.15.4 Demodulator CCA Clock Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FAD_LPPS_THR</name>
          <description>FAD CORRELATOR THRESHOLD</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x60606082</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FAD_THR</name>
              <description>FAD_THR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FAD_FILL1</name>
              <description>Pre-detection buffer filling duration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPPS_FILL_COUNT</name>
              <description>Wait duration after lpps_lp_enable is de-asserted</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPPS_LP_EN_COUNT</name>
              <description>LPPS_LP_EN high time</description>
              <bitOffset>24</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ZBDEM_AFC</name>
          <description>802.15.4 AFC STATUS</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AFC_EN</name>
              <description>AFC_EN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AFC_EN_0</name>
                  <description>AFC is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AFC_EN_1</name>
                  <description>AFC is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCD_EN</name>
              <description>DCD_EN</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DCD_EN_0</name>
                  <description>NCD Mode (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCD_EN_1</name>
                  <description>DCD Mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AFC_OUT</name>
              <description>AFC_OUT</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CCA2_CTRL</name>
          <description>CCA MODE 2 CONTROL REGISTER</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFF05</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CCA2_INTERVAL</name>
              <description>CCA Mode 2 Measurement Window Duration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CCA2_INTERVAL_0</name>
                  <description>64 us</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCA2_INTERVAL_1</name>
                  <description>128 us</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCA2_INTERVAL_2</name>
                  <description>256 us</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCA2_INTERVAL_3</name>
                  <description>512 us</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USE_DEMOD_CCA2</name>
              <description>Selects CCA Mode 2 Computation Engine</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USE_DEMOD_CCA2_0</name>
                  <description>Use standalone (new) CCA Mode 2 Engine, decoupled from demodulator</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USE_DEMOD_CCA2_1</name>
                  <description>Use 802.15.4 demodulator-based (legacy) CCA Mode 2 Engine (default)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CCA2_REF_SEQ</name>
              <description>CCA Mode 2 Sequence Address</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CCA2_THRESH</name>
          <description>CCA MODE 2 CONTROL REGISTER</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x400080</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CCA2_CNT_THRESH</name>
              <description>CCA Mode 2 Count Threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CCA2_SYM_THRESH</name>
              <description>CCA Mode 2 Symbol Threshold</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CCA2_STATUS</name>
          <description>CCA MODE 2 STATUS REGISTER</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CCA2_CNT_MAX</name>
              <description>CCA Mode 2 Maximum Count</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CCA2_COMPLETE</name>
              <description>CCA Mode 2 Measurement Complete</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CCA2_CHANNEL_STATE</name>
              <description>CCA Mode 2 Channel State</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CCA2_CNT_SYM</name>
              <description>CCA Mode 2 Repetition Sequence Addresses Count</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORR_CTRL2</name>
          <description>802.15.4 DEMOD CORRELATOR CONTROL2</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EARLY_PD_THRESH</name>
              <description>EARLY_PD_THRESH</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
