nxp-mcuxpresso/mcux-soc-svd/MCXW716A/MCXW716A.xml
        <register>
          <name>TIMING46</name>
          <description>TSM_TIMING46</description>
          <addressOffset>0xD8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFF7112</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEQ_LO_PUP_VLO_TXDRV_TX_HI</name>
              <description>Assertion time setting for SEQ_LO_PUP_VLO_TXDRV (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_LO_PUP_VLO_TXDRV_TX_LO</name>
              <description>De-assertion time setting for SEQ_LO_PUP_VLO_TXDRV (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_LO_PUP_VLO_TXDRV_RX_HI</name>
              <description>Assertion time setting for SEQ_LO_PUP_VLO_TXDRV (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_LO_PUP_VLO_TXDRV_RX_LO</name>
              <description>De-assertion time setting for SEQ_LO_PUP_VLO_TXDRV (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING47</name>
          <description>TSM_TIMING47</description>
          <addressOffset>0xDC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5B137157</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEQ_DIVN_PUP_TX_HI</name>
              <description>Assertion time setting for SEQ_DIVN_PUP (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_DIVN_PUP_TX_LO</name>
              <description>De-assertion time setting for SEQ_DIVN_PUP (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_DIVN_PUP_RX_HI</name>
              <description>Assertion time setting for SEQ_DIVN_PUP (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_DIVN_PUP_RX_LO</name>
              <description>De-assertion time setting for SEQ_DIVN_PUP (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING48</name>
          <description>TSM_TIMING48</description>
          <addressOffset>0xE0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5B23715A</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEQ_DIVN_CLOSEDLOOP_TX_HI</name>
              <description>Assertion time setting for SEQ_DIVN_CLOSEDLOOP (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_DIVN_CLOSEDLOOP_TX_LO</name>
              <description>De-assertion time setting for SEQ_DIVN_CLOSEDLOOP (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_DIVN_CLOSEDLOOP_RX_HI</name>
              <description>Assertion time setting for SEQ_DIVN_CLOSEDLOOP (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_DIVN_CLOSEDLOOP_RX_LO</name>
              <description>De-assertion time setting for SEQ_DIVN_CLOSEDLOOP (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING49</name>
          <description>TSM_TIMING49</description>
          <addressOffset>0xE4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5B23715A</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEQ_PD_EN_PD_DRV_TX_HI</name>
              <description>Assertion time setting for SEQ_PD_EN_PD_DRV (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_PD_EN_PD_DRV_TX_LO</name>
              <description>De-assertion time setting for SEQ_PD_EN_PD_DRV (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_PD_EN_PD_DRV_RX_HI</name>
              <description>Assertion time setting for SEQ_PD_EN_PD_DRV (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_PD_EN_PD_DRV_RX_LO</name>
              <description>De-assertion time setting for SEQ_PD_EN_PD_DRV (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING50</name>
          <description>TSM_TIMING50</description>
          <addressOffset>0xE8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5B2BFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEQ_CBPF_EN_DCOC_TX_HI</name>
              <description>Assertion time setting for SEQ_CBPF_EN_DCOC (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_CBPF_EN_DCOC_TX_LO</name>
              <description>De-assertion time setting for SEQ_CBPF_EN_DCOC (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_CBPF_EN_DCOC_RX_HI</name>
              <description>Assertion time setting for SEQ_CBPF_EN_DCOC (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_CBPF_EN_DCOC_RX_LO</name>
              <description>De-assertion time setting for SEQ_CBPF_EN_DCOC (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING51</name>
          <description>TSM_TIMING51</description>
          <addressOffset>0xEC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5B2BFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEQ_RX_GANG_PUP_TX_HI</name>
              <description>Assertion time setting for SEQ_(RX_LAN/RX_MIX/CBPF/ADC_PUP) and SEQ_SPARE1 (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_RX_GANG_PUP_TX_LO</name>
              <description>De-assertion time setting for SEQ_(RX_LAN/RX_MIX/CBPF/ADC_PUP) and SEQ_SPARE1 (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_RX_GANG_PUP_RX_HI</name>
              <description>Assertion time setting for SEQ_(RX_LAN/RX_MIX/CBPF/ADC_PUP) and SEQ_SPARE1 (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_RX_GANG_PUP_RX_LO</name>
              <description>De-assertion time setting for SEQ_(RX_LAN/RX_MIX/CBPF/ADC_PUP) and SEQ_SPARE1 (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING52</name>
          <description>TSM_TIMING52</description>
          <addressOffset>0xF0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEQ_SPARE3_TX_HI</name>
              <description>Assertion time setting for SEQ_SPARE3 (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_SPARE3_TX_LO</name>
              <description>De-assertion time setting for SEQ_SPARE3 (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_SPARE3_RX_HI</name>
              <description>Assertion time setting for SEQ_SPARE3 (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_SPARE3_RX_LO</name>
              <description>De-assertion time setting for SEQ_SPARE3 (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
