nxp-mcuxpresso/mcux-soc-svd/MCXW716A/MCXW716A.xml
        <register>
          <name>DBG_RAM_CTRL</name>
          <description>DBG Ram control register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DBG_PAGE</name>
              <description>Packet RAM Debug Page Selector</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DBG_PAGE_0</name>
                  <description>DMA idle</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DBG_PAGE_1</name>
                  <description>RXDIG-IQ: Select from (mixer, decimator, pd channel filter, src, cfo-mixer, demod chan filter) in RXDIG. 11bit signed data, MSB aligned</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DBG_PAGE_2</name>
                  <description>RXDIG-IQ-ALT: Same as above + signals on unused LSBs : {antenna switch, GenLL or 802.15.4LL CRC_FAIL} on &quot;Q&quot; LSBs, {preamble_found, aa_sfd_matched} on &quot;I&quot; LSBs.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DBG_PAGE_3</name>
                  <description>ADC-IQ: 11bit samples are MSB aligned in each 16bit half-word</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DBG_PAGE_4</name>
                  <description>PHASE: Select from (sync phase, demod phase) within RXDIG. MSB aligned</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DBG_PAGE_5</name>
                  <description>RSSI-PHASE: select from 8bit Narrowband (rssi, rssi raw, lqi, snr, noise) and Wideband(rssi, rssi raw) + 8bit high-resolution PHASE</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DBG_PAGE_6</name>
                  <description>MAG-PHASE: RSSI magnitude + 8bit high-resolution PHASE</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DBG_PAGE_7</name>
                  <description>GEN4-PHY</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBG_SIGNAL_VALID_MASK_EN</name>
              <description>DBG Signal Valid Mask Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DBG_SIGNAL_VALID_MASK_EN_0</name>
                  <description>Disable use of dbg_signal_valid_mask.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DBG_SIGNAL_VALID_MASK_EN_1</name>
                  <description>Enable use of dbg_signal_valid_mask.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBG_START_TRG</name>
              <description>DMA Start Trigger Selector</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DBG_START_TRG_0</name>
                  <description>no trigger</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DBG_START_TRG_1</name>
                  <description>PHY: pd found</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DBG_START_TRG_2</name>
                  <description>PHY: aa found</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DBG_START_TRG_3</name>
                  <description>Zigbee_PHY: pd found</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DBG_START_TRG_4</name>
                  <description>Zigbee_PHY: sfd detect</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DBG_START_TRG_5</name>
                  <description>RXDIG: agc_gain_chg</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DBG_START_TRG_6</name>
                  <description>TSM: rx_dig_en</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DBG_START_TRG_7</name>
                  <description>TSM: tsm_irq0_start_trig</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DBG_START_TRG_8</name>
                  <description>CRC pass</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DBG_START_TRG_9</name>
                  <description>CRC done (Not used for 15.4LL)</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DBG_START_TRG_10</name>
                  <description>Localization control: pattern match</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DBG_START_TRG_11</name>
                  <description>GenericLL: cte_present, Bluetooth LE: cte_en</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DBG_START_TRG_12</name>
                  <description>Ranging sequence manager: dma_trigger</description>
                  <value>0xC</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBG_START_EDGE</name>
              <description>DBG Start Trigger Edge Selector</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DBG_START_EDGE_0</name>
                  <description>Trigger fires on a rising edge of the selected trigger source</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DBG_START_EDGE_1</name>
                  <description>Trigger fires on a falling edge of the selected trigger source</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBG_STOP_EDGE</name>
              <description>DBG Stop Trigger Edge Selector</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DBG_STOP_EDGE_0</name>
                  <description>Trigger stops on a rising edge of the selected trigger source</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DBG_STOP_EDGE_1</name>
                  <description>Trigger stops on a falling edge of the selected trigger source</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBG_DEC</name>
              <description>DBG Decimation Rate</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DBG_DEC_0</name>
                  <description>Data is captured on every data valid</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DBG_DEC_1</name>
                  <description>Data is captured on every 2nd data valid</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DBG_DEC_2</name>
                  <description>Data is captured on every 4th data valid</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DBG_DEC_3</name>
                  <description>Data is captured on every 8th data valid</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBG_START_DLY</name>
              <description>DBG Start Trigger Delay</description>
              <bitOffset>12</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBG_EN</name>
              <description>DBG Enable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBG_AA_TRIGGERED</name>
              <description>DBG Access Address triggered</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DBG_START_TRIGGERED</name>
              <description>DBG Start Trigger Occurred</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DBG_STOP_TRIGGERED</name>
              <description>DBG Stop Trigger Occurred</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DBG_RAM_FULL</name>
              <description>DBG_RAM_FULL</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DBG_RAM_FULL_0</name>
                  <description>Packet RAM is not full</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DBG_RAM_FULL_1</name>
                  <description>Packet RAM is full</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBG_STOP_TRG</name>
              <description>Packet RAM Debug Stop Trigger Selector</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DBG_STOP_TRG_0</name>
                  <description>no trigger</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DBG_STOP_TRG_1</name>
                  <description>PHY: pd found</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DBG_STOP_TRG_2</name>
                  <description>PHY: aa found</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DBG_STOP_TRG_3</name>
                  <description>Zigbee_PHY: pd found</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DBG_STOP_TRG_4</name>
                  <description>Zigbee_PHY: sfd detect</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DBG_STOP_TRG_5</name>
                  <description>RXDIG: agc_gain_chg</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DBG_STOP_TRG_6</name>
                  <description>TSM: rx_dig_en</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DBG_STOP_TRG_7</name>
                  <description>TSM: tsm_irq1_stop_trig</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DBG_STOP_TRG_8</name>
                  <description>CRC fail</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DBG_STOP_TRG_9</name>
                  <description>CRC done (Not used for 15.4LL)</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DBG_STOP_TRG_10</name>
                  <description>RBME: error</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DBG_STOP_TRG_11</name>
                  <description>GenericLL header fail</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DBG_STOP_TRG_12</name>
                  <description>PLL unlock</description>
                  <value>0xC</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DBG_RAM_ADDR</name>
          <description>DBG RAM ADDRESS</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x47FC0000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DBG_RAM_FIRST</name>
              <description>DBG RAM First Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBG_RAM_LAST</name>
              <description>DBG RAM Last Address</description>
              <bitOffset>16</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DBG_RAM_STOP_ADDR</name>
          <description>DBG RAM STOP ADDRESS</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DBG_RAM_STOP</name>
              <description>DBG RAM Stop Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LDO_TRIM_0</name>
          <description>LDO TRIM Configuration 0</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LDO_PLL_TRIM_OFFSET</name>
              <description>LDO PLL TRIM Offset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LDO_VCO_TRIM_OFFSET</name>
              <description>LDO VCO TRIM Offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LDO_RXTXLF_TRIM_OFFSET</name>
              <description>LDO RXTXLF TRIM Offset</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LDO_RXTXHF_TRIM_OFFSET</name>
              <description>LDO RXTXHF TRIM Offset</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LDO_TRIM_SMPL_DLY</name>
              <description>LDO TRIM Sample Delay</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LDO_TRIM_CMPOUT_INV</name>
              <description>LDO TRIM CMPOUT Invert</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LDO_CAL_TRIMSEL_OVRD</name>
              <description>LDO_CAL_TRIMSEL Override Value</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LDO_PLL_TRIMSEL_OVRD</name>
              <description>LDO_PLL_TRIMSEL Override Value</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LDO_VCO_TRIMSEL_OVRD</name>
              <description>LDO_VCO_TRIMSEL Override Value</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LDO_RXTXHF_TRIMSEL_OVRD</name>
              <description>LDO_RXTXHF_TRIMSEL Override Value</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LDO_TRIM_SAMPLE_OVRD</name>
              <description>LDO_TRIM_SAMPLE Override Value</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LDO_SAMPLE_TRIMSEL_OVRD_EN</name>
              <description>LDO SAMPLE TRIMSEL Override Enable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LDO_TRIM_1</name>
          <description>LDO TRIM Configuration 1</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LDO_PLL_TRIM_OVRD</name>
              <description>LDO PLL TRIM Override Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LDO_PLL_TRIM_OVRD_EN</name>
              <description>LDO PLL TRIM Override Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LDO_VCO_TRIM_OVRD</name>
              <description>LDO VCO TRIM Override Value</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LDO_VCO_TRIM_OVRD_EN</name>
              <description>VCO TRIM Override Enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LDO_RXTXLF_TRIM_OVRD</name>
              <description>LDO RXTXLF TRIM Override Value</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LDO_RXTXLF_TRIM_OVRD_EN</name>
              <description>LDO RXTXLF TRIM Override Enable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LDO_RXTXHF_TRIM_OVRD</name>
              <description>LDO RXTXHF TRIM Override Value</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LDO_RXTXHF_TRIM_OVRD_EN</name>
              <description>LDO RXTXHF TRIM Override Enable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
