nxp-mcuxpresso/mcux-soc-svd/MCXW716A/MCXW716A.xml
        <register>
          <name>RSM_CTRL0</name>
          <description>Ranging Sequence Manager Control</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RSM_MODE</name>
              <description>RSM_MODE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RSM_MODE_0</name>
                  <description>SQTE</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSM_MODE_1</name>
                  <description>PDE</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RSM_RATE</name>
              <description>RSM_RATE</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RSM_RATE_0</name>
                  <description>1Mbps</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSM_RATE_1</name>
                  <description>2Mbps</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RSM_RX_EN</name>
              <description>RSM_RX_EN</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSM_TX_EN</name>
              <description>RSM_TX_EN</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSM_FAST_IP_RX_WU</name>
              <description>RSM_FAST_IP_RX_WU</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSM_FAST_IP_TX_WU</name>
              <description>RSM_FAST_IP_TX_WU</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSM_FAST_FC_RX_WU</name>
              <description>RSM_FAST_FC_RX_WU</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSM_FAST_FC_TX_WU</name>
              <description>RSM_FAST_FC_TX_WU</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSM_SW_ABORT</name>
              <description>RSM_SW_ABORT</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSM_TRIG_SEL</name>
              <description>RSM_TRIG_SEL</description>
              <bitOffset>10</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RSM_TRIG_SEL_0</name>
                  <description>software trigger</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSM_TRIG_SEL_1</name>
                  <description>crc_vld</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSM_TRIG_SEL_2</name>
                  <description>aa_fnd_to_ll</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSM_TRIG_SEL_3</name>
                  <description>tx_dig_en</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSM_TRIG_SEL_4</name>
                  <description>seq_spare3</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSM_TRIG_SEL_5</name>
                  <description>lcl pattern_match</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RSM_TRIG_DLY</name>
              <description>RSM_TRIG_DLY</description>
              <bitOffset>13</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSM_STEPS</name>
              <description>RSM_FREQUENCY_STEP</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RSM_CTRL1</name>
          <description>Ranging Sequence Manager Control</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RSM_T_FM0</name>
              <description>RSM_T_FM0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSM_T_FM1</name>
              <description>RSM_T_FM1</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSM_T_FC</name>
              <description>RSM_T_FC</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSM_T_IP1</name>
              <description>RSM_T_IP1</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSM_T_IP2</name>
              <description>RSM_T_IP2</description>
              <bitOffset>21</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSM_T_S</name>
              <description>RSM_T_S</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RSM_CTRL2</name>
          <description>Ranging Sequence Manager Control</description>
          <addressOffset>0x7C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RSM_T_PM0</name>
              <description>RSM_T_PM0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSM_T_PM1</name>
              <description>RSM_T_PM1</description>
              <bitOffset>6</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSM_T_PM2</name>
              <description>RSM_T_PM2</description>
              <bitOffset>12</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSM_T_PM3</name>
              <description>RSM_T_PM3</description>
              <bitOffset>18</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSM_ACTIVE_OVRD_LCL</name>
              <description>RSM_ACTIVE_OVRD_LCL</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSM_ACTIVE_OVRD_EN_LCL</name>
              <description>RSM_ACTIVE_OVRD_EN_LCL</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RSM_ACTIVE_OVRD_EN_LCL_0</name>
                  <description>Disable override rsm_active of LCL_CTRL module.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSM_ACTIVE_OVRD_EN_LCL_1</name>
                  <description>Enable override rsm_active of LCL_CTRL module.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RSM_ACTIVE_OVRD_TXDIG</name>
              <description>RSM_ACTIVE_OVRD_TXDIG</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSM_ACTIVE_OVRD_EN_TXDIG</name>
              <description>RSM_ACTIVE_OVRD_EN_TXDIG</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RSM_ACTIVE_OVRD_EN_TXDIG_0</name>
                  <description>Disable override rsm_active of TXDIG module.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSM_ACTIVE_OVRD_EN_TXDIG_1</name>
                  <description>Enable override rsm_active of TXDIG module.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RSM_ACTIVE_OVRD_RXDIG</name>
              <description>RSM_ACTIVE_OVRD_RXDIG</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSM_ACTIVE_OVRD_EN_RXDIG</name>
              <description>RSM_ACTIVE_OVRD_EN_RXDIG</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RSM_ACTIVE_OVRD_EN_RXDIG_0</name>
                  <description>Disable override rsm_active of RXDIG module.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSM_ACTIVE_OVRD_EN_RXDIG_1</name>
                  <description>Enable override rsm_active of RXDIG module.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RSM_CTRL3</name>
          <description>Ranging Sequence Manager Control</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RSM_DT_RX_SYNC_DLY</name>
              <description>RSM_DT_RX_SYNC_DLY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSM_DT_RX_SYNC_DIS</name>
              <description>RSM_DT_RX_SYNC_DIS</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSM_AA_HAMM</name>
              <description>RSM_AA_HAMM</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSM_HPM_CAL</name>
              <description>RSM_HPM_CAL</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSM_CTUNE</name>
              <description>RSM_CTUNE</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSM_DMA_RX_EN</name>
              <description>RSM_DMA_RX_EN</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSM_RX_PHY_EN_MASK_DIS</name>
              <description>RSM_RX_PHY_EN_MASK_DIS</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSM_RX_SIGNALS_MASK_DIS</name>
              <description>RSM_RX_SIGNALS_MASK_DIS</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSM_SEQ_RCCAL_PUP_MASK_DIS</name>
              <description>RSM_SEQ_RCCAL_PUP_MASK_DIS</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSM_DMA_DUR</name>
              <description>DMA Duration</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RSM_CTRL4</name>
          <description>Ranging Sequence Manager Control</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RSM_DMA_DLY0</name>
              <description>DMA Delay 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSM_DMA_DLY</name>
              <description>DMA Delay</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSM_DMA_DUR0</name>
              <description>DMA Duration 0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_DFT_CTRL</name>
          <description>RF DFT CTRL</description>
          <addressOffset>0x9C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RADIO_DFT_MODE</name>
              <description>Radio DFT mode control</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RADIO_DFT_MODE_0</name>
                  <description>Normal Mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RADIO_DFT_MODE_1</name>
                  <description>Carrier Only</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RADIO_DFT_MODE_2</name>
                  <description>Pattern Register</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RADIO_DFT_MODE_3</name>
                  <description>LFSR</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RADIO_DFT_MODE_4</name>
                  <description>RAM Modulation</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RADIO_DFT_MODE_10</name>
                  <description>Coarse Tune BIST, no modulation</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RADIO_DFT_MODE_11</name>
                  <description>PLL Locking BIST, no modulation</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RADIO_DFT_MODE_12</name>
                  <description>HPM DAC Cal BIST, no modulation</description>
                  <value>0xC</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>IPS_FO_ADDR[%s]</name>
          <description>IPS FAST OVERWRITE ADDRESS</description>
          <addressOffset>0xA0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADDR</name>
              <description>IPS Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENTRY_RX</name>
              <description>Enable Entry for RX</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENTRY_TX</name>
              <description>Enable Entry for TX</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>IPS_FO_DRS0_DATA[%s]</name>
          <description>IPS FAST OVERWRITE DRS0 DATA</description>
          <addressOffset>0xC0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DRS0_DATA</name>
              <description>Fast Overwrite DRS0 data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>IPS_FO_DRS1_DATA[%s]</name>
          <description>IPS FAST OVERWRITE DRS1 DATA</description>
          <addressOffset>0xE0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DRS1_DATA</name>
              <description>Fast Overwrite DRS1 data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
